Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series?

In [ ]:
import pandas as pd 
data=[4, 8, 15, 16, 23,42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it?

In [ ]:
data_list=["bow","erase","john",45,96,12,74,"l1","a1","e1"]
pd.Series(data_list)

0      bow
1    erase
2     john
3       45
4       96
5       12
6       74
7       l1
8       a1
9       e1
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:
Name     Age     Gender
Alice    25      Female
Bob      30      Male
Claire   27      Female
Then, print the DataFrame.

In [15]:
dl={"Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]}

In [17]:
pd.DataFrame(dl)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.DataFrame  can be  store data of different types (e.g., numerical, categorical, textual) in rows and columns,similar to a spreadsheet or SQL table.

A DataFrame consists of rows and columns, where each column can be thought of as a Series object

In [24]:
dl={"Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]}
g=pd.DataFrame(dl)
print(g)
type(g)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

Series: A Series is a 1-dimensional labeled array that can store homogeneous data of any type (e.g., integer, float, string, etc.). In other words, a Series is a single column of a DataFrame.

In [26]:
print(g["Name"])
type(g["Name"])

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [29]:
data={"job_p":["Python Developer","Android Developer","Software Development"]
      ,"salary":[50000,60000,70000],"location":["Delhi","Mumbai","Banglore"]}
df=pd.DataFrame(data)

 Some of the commons functions that were discussed during  lecture that can be used to manipulate data in Pandas are

1.df.head(n):In Pandas, df.head(n) is a method of a DataFrame object that returns the first n rows of the DataFrame,and if we not assign n value then it will be return first 5 rows.

In [32]:
df.head()

                  job_p  salary  location
0      Python Developer   50000     Delhi
1     Android Developer   60000    Mumbai
2  Software Development   70000  Banglore

1.df.tail(n):In Pandas, df.tail(n) is a method of a DataFrame object that returns the last n rows of the DataFrame,and if we not pass argument n value then it will be return last 5 rows.

In [31]:
df.tail(2)

                  job_p  salary  location
1     Android Developer   60000    Mumbai
2  Software Development   70000  Banglore

3.df.columns: df.columns returns the column names of a dataframe

In [34]:
df.columns

Index(['job_p', 'salary', 'location'], dtype='object')

4.df.dtypes: returns the data type of all the columns in a dataframe

In [38]:
df.dtypes

job_p       object
salary       int64
location    object
dtype: object

5.df.shape: returns the number of rows and columns in the DataFrame.

In [39]:
df.shape

(3, 3)

6.df[]: is not a pandas method, but it can be used to access a single column from a datframe.

In [42]:
df["salary"]

0    50000
1    60000
2    70000
Name: salary, dtype: int64

7.df[[]]: is not a pandas method, but can be used to access multiple columns of a dataframe

In [43]:
df[["salary","location"]]

   salary  location
0   50000     Delhi
1   60000    Mumbai
2   70000  Banglore

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Pandas Series, DataFrame and Panel all of them are mutable but panel has been deprecated and is no longer recommended for use

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [51]:
s1=pd.Series([45,89,74,63])
s2=pd.Series([78,65,41,78,2])
s3=pd.Series([45,32,78,6])
pd.DataFrame({"cl":s1,"cl2":s2,"cl3":s3})

     cl  cl2   cl3
0  45.0   78  45.0
1  89.0   65  32.0
2  74.0   41  78.0
3  63.0   78   6.0
4   NaN    2   NaN